flix/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"  WHERE (released_on <= '2015-11-19 22:05:44.182615')  ORDER BY released_on desc
---
	def index
		@movies = Movie.all