flix/app/controllers/reviews_controller.rb

	def edit
		@review = @movie.reviews.find(params[:id])
---
SELECT  "reviews".* FROM "reviews"  WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 1], ["id", 3]]

	def update
		@review = @movie.reviews.find(params[:id])
		if @review.update(review_params)
---
SELECT  "reviews".* FROM "reviews"  WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 1], ["id", 3]]
UPDATE "reviews" SET "name" = ?, "stars" = ?, "updated_at" = ? WHERE "reviews"."id" = 3  [["name", "Peter Travers"], ["stars", 5], ["updated_at", "2015-11-26 02:50:42.954946"]]

	def destroy
		@review = @movie.reviews.find(params[:id])
		@review.destroy
---
SELECT  "reviews".* FROM "reviews"  WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 1], ["id", 5]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 5]]