flix/app/views/movies/index.html.erb

<h1><%= pluralize(@movies.size, 'Movie') %></h1>
---
SELECT "movies".* FROM "movies"  WHERE (released_on <= '2015-11-19 22:05:44.182615')  ORDER BY released_on desc