flix/app/views/movies/show.html.erb


  <% if @movie.reviews.any? %>
---
SELECT  1 AS one FROM "reviews"  WHERE "reviews"."movie_id" = ? LIMIT 1  [["movie_id", 1]]
SELECT "reviews".* FROM "reviews"  WHERE "reviews"."movie_id" = ?  ORDER BY created_at desc  [["movie_id", 1]]